Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine.Width Property
 The line width in pixels. NOTE: Currently the valid width values are 1, 2 and 4
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GraphicPolyLine Class
Tekla.Structures.Model.UI Namespace